---
kind: other
id: Methods.T:Autodesk.Revit.DB.IPhotoRenderContext
source: html/80234360-b547-cf45-8194-8550cba06023.htm
---
# IPhotoRenderContext Methods

This method is called at the very end of the export process,
 after all entities were processed (or after the process was cancelled).